In [8]:
import pandas as pd

In [11]:
df = pd.read_csv('core_biographies.csv')
df.head()

,Name,Date of birth,Date of death,Age,Country of birth,Country of death,Occupation
0,Aeschylus,c. 525 BC,c. 456 BC,69,Greece,Italy,Writer
1,Akbar,"October 24, 1542","October 12, 1605",62,Pakistan,India,Politician
2,Muhammad ibn Musa al-Khwarizmi,780,850,70,Uzbekistan,Iraq,Scientist
3,Alexander the Great,"July 20, 356 BC","June 10, 323 BC",32,Greece,Iraq,Politician
4,Muhammad Ali,"January 17, 1942","June 3, 2016",74,United States,United States,Athlete

In [14]:
df.groupby(['Occupation']).size().sort_values(ascending=False)

Occupation
Politician     58
Scientist      44
Writer         36
Artist         25
Philosopher    19
Theologian     13
Athlete         6
dtype: int64